Repository: arunkumarbhattar/FlexC_EVAL
Catalog: CVES/LinuxFlaw/CVE-2012-4409/mcrypt-2.5.8/po/*.po
Languages: cs

source: Re-
cs: Znova

source: Keywords do not match or they are too long.
cs: Klíèová slova nesouhlasí a nebo jsou moc dlouhá.

source: Enter passphrase:
cs: Zadejte klíèovací frázi:

source: Enter the passphrase (maximum of %d characters)
cs: Zadejte klíèovací frázi (maximum je %d znakù)

source: Please use a combination of upper and lower case letters and numbers.
cs: Pou¾ijte prosím kombinaci velkých, malých písmen a èísel.

source: Unsupported version of encrypted file
cs: Nepodporovaná verze za¹ifrovaného souboru

source: No Initialization vector was used.
cs: Inicializaèní vektor nebyl pou¾it.

source: This is a file encrypted with the 2.2 version of mcrypt. Unfortunately you'll need that version to decrypt it.
cs: Toto je soubor za¹ifrovaný programem mcrypt verze 2.2Bohu¾el budete potøebovat toto verzi pro de¹ifrování.

source: This is a file encrypted with the 2.1 version of mcrypt. Unfortunately you'll need that version to decrypt it.
cs: Toto je soubor za¹ifrovaný programem mcrypt verze 2.1Bohu¾el budete potøebovat toto verzi pro de¹ifrování.

source: Unable to get algorithm information. Use the --bare flag and specify the algorithm manualy.
cs: Nemohu získat informaci o algoritmu. Pou¾ij pøíznak --bare a specifikuj algoritmus manuálnì.

source: Signal %d caught. Exiting.
cs: Zachycen signál %d. Konèím.

source: Signal %d caught. Exiting.
cs: Zachycen signál %d. Konèím.

source: Keyfile could not be opened. Ignoring it.
cs: Nelze otevøít klíèový soubor. Ignoruji.

source: Keyfile could not be locked. Ignoring it.
cs: Nelze uzamknout klíèový soubor. Ignoruji.

source: %s: %s already exists; do you wish to overwrite (y or n)?
cs: %s: %s ji¾ existuje; pøepsat (y or n)?

source: Usage: mcrypt [-dLFus87bhvrx] [-f keyfile] [-k key1 key2 ...] [-m mode] [-o keymode] [-s keysize] [-a algorithm] [-c config_file] [file ...]
cs: Pou¾ití: mcrypt [-dLFus87bhvrx] [-f klíèový_soubor] [-k klíè1 klíè2 ...] [-m mód] [-i bitový mód] [-a algoritmus] [-c konfiguraèní_soubor] [soubor ...]

source: mcrypt encrypts/decrypts files using several symmetric algorithms.
cs: mcrypt za¹ifruje/de¹ifruje soubory za pou¾ití symetrických algoritmù.

source: Legal parameters are: -d --decrypt decrypts -c --config FILENAME Use the configuration file FILENAME. If not specified the .mcryptrc in your home directory is used. -a --algorithm ALGORITHM specify the encryption and decryption algorithm. Use the --list parameter to see the supported algorithms. --algorithms_directory DIR specify the directory where the algorithms are.
cs: Správné parametry jsou: -d --decrypt De¹ifruje -c --config SOUBOR Pou¾ij konfiguraèní soubor SOUBOR. Pokud není urèen, pou¾ije se .mcryptrc ve va¹em domovském adresáøi. -a --algorithm ALGORITMUS urèí ¹ifrovací a de¹ifrovací algoritmus. Správné parametry jsou:

source: -m --mode MODE specify the mode. Use the --list parameter to see the supported modes. --modes_directory DIR specify the directory where the modes are. -k --key KEY1, KEY2, ... keyword(s) to use. -f --keyfile FILENAME file to read the keyword from. -o --keymode MODE specify the keyword mode. Use the --keymodeslist parameter to view all modes. -h --hash ALGORITHM specify the hash algorithm to be used, in order to compute the checksum. Use the --hashlist parameter to view all algorithms. -s --keysize SIZE Algorithm's key size. The default is the maximum supported by the algorithm. -u --unlink unlink the input file after encryption/decryption -L --license displays license information. -q --quiet suppress some non critical warnings. -l --doublecheck Double check for passphrase even if decrypting. --echo Echo asterisks when entering the password. --list Lists the supported algorithms and modes. --keymodeslist Lists the supported key modes. --hashlist Lists the supported hash algorithms. --flush Immediately flush the output. --nodelete Does not delete the output file even if decryption fails. -V --verbose more information is displayed. -b --bare Do not keep algorithm information in the encrypted file. -F --force forces output to stdout.
cs: -m --mode MÓD urèí mód. Pou¾ij parametr --list pro výpis podporovaných módù. --modes_directory ADRESÁØ urèi adresáø kde jsou módy k pou¾ití. -k --key KLÍÈ1, KLÍÈ2, ... klíè(e) k pou¾ití. -f --keyfile SOUBOR soubor v nìm¾ je klíèové slovo. -o --keymode MÓD zadej mód klíèe. Pou¾ij --keymodeslist argument pro výpis v¹ech módù. -h --hash ALGORITMUS urèi algoritmus který bude pou¾it v poøadí pro poèítání kontrolní souèet. Pou¾ij --hashlist parametr pro pro výpis v¹ech algoritmù. -s --keysize VELIKOST velikost klíèe algoritmu.Bez urèení je maximum podporovaný algoritmem. -u --unlink sma¾ vstupní soubor po za¹ifrování/de¹ifrování -L --license zobrazí licenèní informace. -q --quiet potlaè nìkterá nekritická varování. -l --doublecheck Zdvoj kontrolu pro klíèovací frázi --echo Zobrazuj hvìzdièky kdy¾ zadávám heslo. --list vypi¹ podporované algoritmy a módy. --keymodeslist vypi¹ podporované klíèovací módy. --hashlist vypi¹ podporované ha¹ovaci algoritmy. --flush okam¾itì vyprázdni výstup. --nodelete nema¾ výstupní soubor dokud roz¹ifrovávaní neprobìhlo. -V --verbose zobraz nìkteré dal¹í informace. -b --bare nenechávej informaci o algoritmu v za¹ifrovaném souboru. -F --force vnutí výstup na stdout (standartnívýstup).

source: -r --random Use real random data.
cs: -r --random pou¾ij opravdu náhodná data.

source: -z --gzip use gzip to compress files before encryption.
cs: -z --gzip pou¾ij gzip na komprimaci souborù pøed za¹ifrováním.

source: -p --bzip2 use bzip2 to compress files before encryption.
cs: -p --bzip2 pou¾ij bzip2 na komprimaci souborù pøed za¹ifrováním.

source: -n --nolock Do not lock files.
cs: -n --nolock neuzamykej soubory.

source: Linked against libmcrypt v.%s
cs: Slinkováno proti libmcrypt v.%s

source: Error in the arguments.
cs: Chyba v argumentech.

source: Warning: Cannot access config file.
cs: Varování: Nemám pøístup ke konfiguraènímu souboru.

source: Error in the configuration file.
cs: Chyba v konfiguraèním souboru.

source: The '%s' hash algorithm was not found.
cs: Ha¹ovací Algoritmus '%s' nebyl nalezen.

source: Use the --hashlist parameter to view all supported hashes.
cs: Pou¾ij parametr --hashlist pro výpis podporových he¹ù.

source: Error in algorithm '%s'.
cs: Chyba v algoritmu '%s'.

source: Error in mode '%s'.
cs: Chyba v módu '%s'.

source: The specified key size is too large for this algorithm.
cs: Urèená velikost klíèe je pøíli¹ dlouhá pro tento algoritmus.

source: The specified key size not valid for this algorithm.
cs: Urèený klíè není platný pro tento algoritmus.

source: Warning: It is insecure to specify keywords in the command line
cs: Varování: Není bezpeèné specifikovat klíèová slova na pøíkazové øádce

source: Warning: Using pseudo random numbers
cs: Varování: Pou¾ívám pseudo náhodná èísla

source: %s: %s is not a regular file. Skipping...
cs: %s: %s není regulérní soubor. Pøeskakuji...

source: %s: Encrypted data will not be read from a terminal.
cs: %s: Za¹ifrovaná data nebudou ètena z terminálu.

source: Redirect the input instead. Use the --help parameter for more help.
cs: Pøesmìruj vstup. Pou¾ij parametr --help pro lep¹í vysvìtlení.

source: %s: Encrypted data will not be written to a terminal.
cs: %s: Za¹ifrovaná data nebudou zapsána na terminál.

source: Redirect the output instead. Use the --help parameter for more help.
cs: Pøesmìruj vstup. Pou¾ij parametr --help pro lep¹í vysvìtlení.

source: %s: file %s has the .nc suffix... skipping...
cs: %s: soubor %s má pøíponu .nc pøeskakuji...

source: File %s was decrypted.
cs: Soubor %s byl de¹ifrován.

source: Stdin was decrypted.
cs: Stdin (standartní vstup) byl de¹ifrován

source: File %s was NOT decrypted successfully.
cs: Soubor %s NEBYL úspì¹nì de¹ifrován.

source: Stdin was NOT decrypted successfully.
cs: Stdin (standartní vstup) NEBYL úspì¹nì de¹ifrován.

source: File %s was encrypted.
cs: Soubor %s byl za¹ifrován

source: Stdin was encrypted.
cs: Stdin (standartní vstup) byl za¹ifrován

source: File %s was NOT encrypted successfully.
cs: Soubor %s NEBYL úspì¹nì za¹ifrován.

source: Stdin was NOT encrypted successfully.
cs: Stdin (standartní vstup) NEBYL úspì¹nì za¹ifrován.

source: Mcrypt failed to open module.
cs: Mcrypt nemù¾e otevøít modul.

source: Error in keymode '%s'.
cs: Chyba v klíèovacím módu '%s'.

source: Algorithm: %s Key size: %d Mode: %s Keyword mode: %s Digest: %s
cs: Algoritmus: %s Velikost klíèe: %d Mód: %s klíèovací mód: %s Resumé: %s

source: File: %s
cs: Soubor: %s

source: No valid file headers found.
cs: Nenalezeny platné hlavièky souboru.

source: Algorithm: %s Keysize: %d Mode: %s Keyword mode: %s
cs: Algoritmus: %s Velikost klíèe: %d Mód: %s klíèovací mód: %s

source: Corrupted file.
cs: Poru¹ený soubor.

source: Decompressing the output file...
cs: Rozbaluji výstupní soubor...

source: %s check failed
cs: %s kontrola selhala

source: Supported Hash Algorithms:
cs: Podporované Ha¹ovací Algoritmy:

source: Timeout while waiting for file lock.
cs: Timeout pøi èekání na souborový zámek.

source: Key transformation failed.
cs: Transformace klíèe selhala.

source: Cannot allocate memory
cs: Nemohu alokovat pamì»
